//PGMEXEC JOB ,MSGLEVEL=(2,0)
//*
//JSTEP01  EXEC PGM=TEMPNAM0,COND=(0,LT)
//*
//STEPLIB  DD   DSN=Z63081.PERSON.LOADLIB,DISP=SHR
//*
//EXAMFILE DD   DSN=Z63081.PERSONAL.PROJECTS(EXAMDATA),DISP=SHR
//*
//OUTFILE  DD   SYSOUT=*
//*
//SYSUDUMP DD   SYSOUT=*
