//HELLOCOB JOB ,MSGLEVEL=(2,0)
//*
//JSTEP01 EXEC IGYWCL
//*
//COBOL.SYSIN  DD  DSN=Z63081.CBL(EXMPLCOB)
//*
//LKED.SYSLMOD DD  DSN=Z63081.PERSON.LOADLIB,DISP=(MOD,KEEP,KEEP)
